경력사항
- 2017년 01월 – 현재: 뷰로베리타스 한국지점
  - 부서: Marine & Offshore, Marketing & Sales
  - 타이틀: 이사
  - 주요 업무
    - 국내 해운 회사, 국내 선주 대상 마케팅 및 영업
    - 2017년 입사 당시 한국 고객의 BV 선급 선박 수 대비, 현재 이용 선박 수가 약 7배로 성장 시킴
    - 2022년 카타르가스 프로젝트를 회사 창사 최초로 확보
    - 국내 선주사 Owner 등 최고위층과 유대 관계 형성 및 부산 지역 선박관리사의 임원 및 업무 담당자들과 교류 및 업무 협의

- 2012년 03월 – 2016년 12월: 한진해운
  - 부서: 컨테이너선 영업본부, 아주마케팅팀
  - 타이틀: 차장~부장
  - 주요 업무
    - 중동·홍해 노선 담당, Pricing 및 수익성 관리
    - 중동·홍해항로 기획, 예산, 시장분석, 정책수립, pricing/marketing, 산하조직 영업관리, 평가, 프로모션, Global bid 운임 결정 위한 수익성 Simulation 등으로, Bid 방향 결정 및 현장 가이드
    - IRA, IRSA 주도 선사 네트워크 형성(MSC, CMA, Maersk 등)
    - 이란 항만 기항 정부 결정 기여 – 무역 안보의 날 산업부 장관상 수상

- 2011년 07월 – 2012년 03월: 한진해운
  - 부서: 컨테이너선 동서남아지역본부 UAE 지점
  - 타이틀: 부지점장 – 차장
  - 주요 업무
    - 중동·홍해 노선 담당, UAE 및 Gulf 지역 대리점 관리
    - 중동·홍해 10개국 발 아주·미주·구주향 Pricing 전략 수립
    - 주요 화주 RFQ 분석 및 운임 Set up, Share-up 위한 고객관리
    - 두바이 Sharaf 그룹 및 사우디 Globe 그룹 회장들과 대리점 계약 체결

- 2007년 01월 – 2011년 06월: 한진해운
  - 부서: 컨테이너선 영업본부 미주마케팅팀
  - 타이틀: 차장
  - 주요 업무
    - 아시아↔미주 구간 서비스 기획 및 영업수지 관리
    - 미주향 및 역방향 Pricing/Marketing 운영
    - 수익·비용 분석 통한 운임 전략 수립
    - 사업/판매계획 수립 및 점소 실적 관리
    - 주요 화주 계약 관리 및 FMC Filing

- 2004년 07월 – 2006년 12월: 한진해운
  - 부서: 컨테이너영업본부 동북아지역본부 마케팅팀
  - 타이틀: 과장
  - 주요 업무
    - 한국·일본·대만발 미주·아시아향 마케팅 및 Pricing 업무
    - 운임 전략 및 수익모델 기반 사업계획 수립
    - 주요 화주 계약 및 현장 요청 운임 검토·승인

- 2004년 01월 – 2004년 06월: 한진해운
  - 부서: 슬라바티아 및 체코 지역조사
  - 타이틀: 대리
  - 주요 업무
    - 벌크선 사업 전략 수립 및 일반 행정
    - 시황 분석 및 영업 전략 수립

- 2003년 07월 – 2004년 01월: 한진해운
  - 부서: 벌크선 사업 전략 수립 및 일반 행정
  - 타이틀: 대리
  - 주요 업무
    - 벌크선 사업 전략 수립 및 일반 행정
    - 시황 분석 및 영업 전략 수립

- 2000년 12월 – 2003년 06월: 한진해운
  - 부서: 현장영업
  - 타이틀: 사원
  - 주요 업무
    - 미·구주향 현장 영업 및 수출업체 계약
    - 시황 분석 통한 화주 발굴, 견적, 고객 관리
    - 지역 물류시장·항만 이해도 제고 및 신규 고객 유치